[
	{     "id": "1",
        "title": "Créez une page web dynamique avec Javascript",
        "shortdescrition":"Création d'une page web dynamique pour le site internet d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API.",
        "description": [
          "Création d'une page web dynamique pour le site internet d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API. Travail sur la partie Front-End du site, où j'ai développé la page de présentation des travaux de l'architecte à partir du HTML fourni. Cela implique la gestion des événements utilisateurs et la manipulation des éléments du DOM avec JavaScript.", 
          "J'ai également créé une page de connexion pour l'administrateur du site ainsi qu'une modale permettant d'uploader de nouveaux médias. Ces éléments ont été développés from scratch, afin de mettre en pratique mes compétences en JavaScript de manière approfondie. Dans ce projet j'ai eu accès à un code back-end pour tester les fonctionnalités.", 
          "J'ai appris à communiquer avec une API, ce qui est crucial pour les applications web modernes. En terme d'outils, j'ai utilisé Figma pour accéder aux maquettes, Visual Studio Code pour le développement, et GitHub pour la gestion de version du projet."
        ],
        "cover": "Images/Projects/SophieBluel/SB-accueil.webp",
        "ModalImages" :[
          "/Images/Projects/SophieBluel/SB-accueil.webp",
          "/Images/Projects/SophieBluel/SB-Galerie.webp",
          "/Images/Projects/SophieBluel/SB-Modal.webp",
          "/Images/Projects/SophieBluel/SB-ajoutImage.webp"
        ],
        "technologies": ["JavaScript", "API", "HTML", "CSS", "Sass"],
        "tag": "Formation",
        "github": "https://github.com/SamyBidar2/Module-6-Sophie-Bluel",
        "deployed": "",
        "focus" : "JS"
      },
      {
        "id": "2",
        "title": "Créez une application de location immobilière avec React",
        "shortdescrition":"Implémentation du front-end d’une application avec React et React Router pour créer une expérience utilisateur moderne et réactive.",
        "description": [
          "Dans ce projet, j'ai implémenté le front-end d’une application en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive. J'ai travaillé sur la logique de présentation des données et les composants React, une bibliothèque JavaScript populaire pour la création d'interfaces utilisateur. ", 
          "J'ai également utilisé React Router pour configurer la navigation entre les différentes pages de l'application. Ce qui m'a permis de comprendre comment gérer efficacement le routage dans une application web moderne. Dans le contexte de ce projet il m'était demandé de me concentrer exclusivement sur le développement front-end, en me basant sur les maquettes fournies et en utilisant des données simulées extraites d'un fichier JSON.",
          "En terme d'outils, j'ai utilisé Create React APP pour faciliter la configuration initiale de React, Figma pour accéder aux maquettes, Visual Studio Code pour le développement, et GitHub pour la gestion de version du projet."
        ],
        "cover": "/Images/Projects/Kasa/Kasa-Logement.webp",
        "ModalImages" :[
          "/Images/Projects/Kasa/Kasa-Logement.webp",
          "/Images/Projects/Kasa/Kasa-Apropos.webp",
          "/Images/Projects/Kasa/Kasa-home.webp"
        ],
        "technologies": ["React", "React Router", "HTML", "CSS", "Sass"],
        "tag": "Formation",
        "github": "https://github.com/SamyBidar2/kasa",
        "deployed": "",        
        "focus" : "React"
      },
      {
        "id": "3",
        "title": "Optimisez le référencement d'un site de photographe",
        "shortdescrition":"Optimisation du référencement d’un site, en améliorant sa performance et son accessibilité.",
        "description": [
          "Dans ce projet, j'ai optimisé le référencement d’un site, en améliorant sa performance et son accessibilité.",
          "Ma première tâche a été d'identifier les problèmes de chargement et de référencement.",
          "J'ai ensuite apporté des modifications sur la structure du code, minifié les fichiers, redimmensionné et réduit le poids des images. J'ai aussi ajouté un Opengraph, et des Rich Snippet",
          "Enfin j'ai rédigé un rapport résumant toutes les modifications apportées, et montrant les résultats obtenus après optimisation du site",
          "En terme d'outils, j'ai uilisé Lighthouse pour analyser les performances et Wave pour l'accessibilité."
        ],
        "cover": "/Images/Projects/SEO/Nina.webp",
       "ModalImages" :[
          "/Images/Projects/SEO/Nina.webp",
          "/Images/Projects/Kasa/Kasa-Apropos.webp",
          "/Images/Projects/Kasa/Kasa-home.webp"
        ],
        "technologies": ["HTML", "CSS", "SEO", "Lighthouse", "Opengraph","Rich Snippets"],
        "tag": "Formation",
        "github": "https://github.com/SamyBidar2/kasa",
        "deployed": "",        
        "focus" : "CSS"
      },
      {
        "id": "4",
        "title": "Les gourmands nés épisode 1 - Auberge La Moreno",
        "shortdescrition":"Enregistrement des voix off avec Fanny Agostini",
        "description": [
          "L'Auberge de La Moreno est un lieu incontournable pour les amateurs des bons produits auvergnats. ",
          "Pour ce premier épisode des Gourmands Nés, Raphaël et Alexandra DUBERNAT ont invité des amis producteurs et restaurateurs à partager un moment de convivialité dans leur établissement.",
          "Fanny Agostini nous raconte leur histoire."
        ],
        "cover": "/Images/Projects/Sound/Gourmands/Gorumands-1-cover.webp",
       "ModalImages" :[
          "/Images/Projects/Sound/Gourmands/Gourmands-1-patisserie.webp"
        ],
        "technologies": ["Prise de son", "Voix off"],
        "tag": "Sound",
        "github": "https://www.youtube.com/watch?v=D4nXwy4squQ",
        "deployed": "",        
        "focus" : "none"
      },
      {
        "id": "4",
        "title": "Les gourmands nés épisode 2 - Serge Vieira",
        "shortdescrition":"Régie Technique. Prise de son, Edition sonore, Mixage.",
        "description": [
          "Pour ce deuxième épisode, Serge Vieira, bocuse d'or 2005, reçoit les Gourmands Nés dans son château situé à Chaudes-Aigues dans le Cantal. ",
          "Fanny Agostini nous raconte leur histoire."
        ],
        "cover": "/Images/Projects/Sound/Gourmands/Gourmands-2-cover.webp",
       "ModalImages" :[
          "/Images/Projects/Sound/Gourmands/Gourmands-2-cover.webp",
          "/Images/Projects/Sound/Gourmands/Gourmands-2-cover.webp"
        ],
        "technologies": ["Prise de son", "Edition", "Mixage", "Câblage", "Régie technique" ],
        "tag": "Sound",
        "github": "https://www.youtube.com/watch?v=GkX2b7GBVUA&t=1175s",
        "deployed": "",        
        "focus" : "none"
      },
      {
        "id": "5",
        "title": "Les gourmands nés épisode 3 - Régis Marcon",
        "shortdescrition":"Régie Technique, installation et configuration d'une régie mobile.  Prise de son, Edition et Conception sonore, Mixage.",
        "description": [
          "Le temps d'un repas Fanny Agostini, Régis Marcon et Jacques Marcon et Charles Moncouyoux accompagnés de leurs hôtes reviennent avec passion sur leur métier, et les valeurs qu'ils défendent.",
          "Nature et transmission sont les thèmes abordés dans ce troisième épisode."
        ],
        "cover": "/Images/Projects/Sound/Gourmands/Gourmands-3-cover.webp",
       "ModalImages" :[
          "/Images/Projects/Sound/Gourmands/Gourmands-3-cover.webp",
          "/Images/Projects/Sound/Gourmands/Gourmands-3-dégustation.webp",
          "/Images/Projects/Sound/Gourmands/gourmands-3-Fanny-Agostini.webp"
        ],
        "technologies": ["Prise de son", "Edition", "Sound design", "Mixage", "Câblage", "Régie technique" ],
        "tag": "Sound",
        "github": "https://www.youtube.com/watch?v=gDEBZvi4C5s&t=302s",
        "deployed": "",        
        "focus" : "none"
      },
      {
        "id": "6",
        "title": "Services de promotion digitale pour les musiciens",
        "shortdescrition":"Création de différents services digitaux proposés par l'entreprise Upperground Production, à destination des artistes et labels indépendants",
        "description": [
          "En plus de la production d'artistes, Upperground Production propose des services digitaux aux artistes et aux labels",
          "J'ai été ammené par exemple à créer des pages de ventes, créer des pages liens Instagram personnalisés (sorte de linktree), ou un site sur wordpress, intégrant une boutique Woocommerce pour la vente de Cd et de Merchandising",
          "J'ai aussi été amené à mettre en place et à automatiser des campagnes de mailling, des campagnes publicitaires via Google Ads et Facebook Ads, dans le but de promouvoir les dernières sorties de mes clients et d'augmenter leur vues et leur visibilité, et à retravailler le référencement de leurs chaines Youtube"          
        ],
        "cover": "/Images/Projects/Upperground/UGdigital.webp",
        "ModalImages" :[
          "/Images/Projects/Upperground/UGdigital.webp",
          "/Images/Projects/Upperground/Josslinks.webp",
          "/Images/Projects/Upperground/HarnnelLinks.webp"
        ],
        "technologies": ["Wordpress", "Systeme.io", "WooCommerce", "CSS", "Google Ads", "Facebook Ads", "mailchimp", "SEO"],
        "tag": "Digital",
        "github": "https://www.ug-digital.com/",
        "deployed": "",        
        "focus" : "none"
      },
      {
        "id": "7",
        "title": "Enregistrement Session Acoustique - Marina Kaye",
        "shortdescrition":"Enregistrement d'une session acoustique avec la chanteuse Marina Kaye au studio de la Frette",
        "description": [
          "Enregistrement d'une session acoustique avec la chanteuse Marina Kaye au studio de la Frette",
          "Au cours de cette session, mon rôle a été d'accueillir les artistes, de mettre en place et configurer le matériel de manière à obtenir le meilleur résultat sonore, tout en prenant en compte les contraintes visuelles de l'équipe responsable de la réalisation Vidéo.",
          "Mixage réalisé par Jonathan"          
        ],
        "cover": "/Images/Projects/Sound/Marina Kaye/MK freeze1.webp",
        "ModalImages" :[
          "/Images/Projects/Sound/Marina Kaye/MK freeze1.webp",
          "/Images/Projects/Sound/Marina Kaye/MK freeze2.webp",
          "/Images/Projects/Sound/Marina Kaye/MK freeze3.webp",
          "/Images/Projects/Sound/Marina Kaye/MK freeze4.webp"
        ],
        "technologies": ["Wordpress", "Systeme.io", "WooCommerce", "CSS", "Google Ads", "Facebook Ads", "mailchimp", "SEO"],
        "tag": "Sound",
        "github": "https://www.ug-digital.com/",
        "deployed": "",        
        "focus" : "none"
      }
]