[
    {   
        "id":"4",
        "jobtitle": "Formation Intégrateur Web",
        "date": "2023-2024",
        "description" :" Types de missions au cours de la formation : \nCréer une application web complète et responsive. \nDynamiser des pages web. \nCréer des interfaces communiquant avec le back-end du site. \nOptimiser les performances et réaliser la maintenance de sites web. \nGérer un projet web de A à Z : du chiffrage et découpage des tâches du projet à la présentation de la solution, en passant par la rédaction des spécifications techniques. ",
        "company":"Open Classrooms",
        "category": {
            "tag": "Intégration Web, Développement Web, React, Javascript, HTML, CSS",
            "color": "#018f69"
        }
    },
    {   
        "id":"3",
        "jobtitle": "Co-gérant - Le Rimshot",
        "date": "2022-2024",
        "description" :"Création de l’établissement ‘Le Rimshot’ (Restaurant, Bar, Concerts). Gestion de l’établissement, Programmation et promotion de spectacles (Booking Artistes, Promotion, Marketing Digital)",
        "company":"Upperground Production",
        "category": {
            "tag": "Gestion de projet, Marketing digital, Promotion",
            "color": "#018f69"
        }
    },
    
    {   
        "id":"2",
        "jobtitle": "Testeur de logiciel / chargé de Validation",
        "date": "2016-2021",
        "description" :"Test et validation de logiciels et d’applications, étude de spécifications fonctionnelles, réalisation de matrices de tests, suivi des signalements, Création d’automates de test (Ranorex, C#).",
        "company":"CPAM du Puy du Dôme",
        "category": {
            "tag": "Recette Fonctionnelle, Tests, Automatisation de tests, Spécifications fonctionnelles, Reporting, Ranorex, C#",
            "color": "#018f69"
        }
    },
    {   
        "id":"1",
        "jobtitle": "Ingénieur du son",
        "date": "2014-2021",
        "description" :" Enregistrement de MARINA KAYE, MASHROU LEILA, MATHIEU SAIKALY, « Les Gourmand nés » (Chefs REGIS et JACQUES MARCON, SERGE VIERA , LE BUS 26, ...)",
        "company":"Freelance - Upperground Studio",
        "category": {
            "tag": "Enregistrement, Prise de son, Mixage, Sound Design, Edition, Correction Vocale",
            "color": "#018f69"
        }
    }   
]